/*2. Запрограммировать класс "Однонаправленный список".
Предусмотреть "защиту от дурака" на введение размера списка, ограниченного, например, значением 100.

Запрограммировать операции доступ по индексу, добавление элемента, удаление элемента из начала, удаление элемента из конца.
Предусмотреть генерацию исключительных ситуаций:
1) попытка создать список больше максимального размера;
2) попытка обратиться к элементу с номером меньше 0 или больше текущего размера списка;
3) попытка добавить элемент с номером больше максимального размера;
4) попытка удалить элемент из пустого списка.*/
class one_side_list
{
private:
    
public:
    one_side_list();
    ~one_side_list();
};