/*3. Запрограммировать класс «Треугольник». Определить в нем конструкторы и деструктор, перегрузить операцию преобразования
 в вещественное число (площадь треугольника), операцию преобразования в символьную строку и
метод получения объекта-треугольника из строки.
Предусмотреть генерацию исключительных ситуаций:
1) попытка создать треугольник с нулевой или отрицательного значения стороной;
2) попытка создать несуществующий треугольник.*/
class triangle
{
private:

    double side_a;
    double side_b;

    void set_side_a();
    void set_side_b();

public:
    triangle();

    void get_side_a();
    void get_side_b();

    ~triangle();
};