/*1. Запрограммировать класс Вектор.

Предусмотреть "защиту от дурака" на введение размера вектора, ограниченного, например, значением 100.

Запрограммировать операции доступ по индексу, добавление элемента, удаление элемента из начала, удаление элемента из конца.
Предусмотреть генерацию исключительных ситуаций:
1) попытка создать вектор больше максимального размера;
2) попытка обратиться к элементу с номером меньше 0 или больше текущего размера вектора;
3) попытка добавить элемент с номером больше максимального размера;
4) попытка удалить элемент из пустого вектора.*/

class vect
{
private:
    
public:
    vect();
    ~vect();
};